var getNaturalNumbers = require('./index.js');

// Тест 1: Проверка получения простых чисел до 40
console.log("Тест 1:");
console.log(getNaturalNumbers(40)); // Ожидаемый результат: [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37]

// Тест 2: Проверка получения простых чисел до 10
console.log("Тест 2:");
console.log(getNaturalNumbers(10)); // Ожидаемый результат: [2, 3, 5, 7]

// Тест 3: Проверка получения простых чисел до 1
console.log("Тест 3:");
console.log(getNaturalNumbers(1)); // Ожидаемый результат: []

// Тест 4: Проверка получения простых чисел до 100
console.log("Тест 4:");
console.log(getNaturalNumbers(100)); // Ожидаемый результат: [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]
